// План действий:
// 1) Внизу списка находится кнопка «Добавить». При нажатии на неё в конец списка добавляется новая пустая запись.
// 2) Над списком присутствует кнопка сортировки. При нажатии на неё записи сортируются по алфавиту. 
// 3) Повторное нажатие приводит к сортировке по алфавиту в обратном порядке. 
// 4) После каждого нажатия кнопка меняет свое состояние, показывая пользователю, 
// в каком порядке будет происходить сортировка (прямом или обратном).

// 5) В начальном состоянии список содержит одну пустую запись.

